package nio;

/**
 * @author ：yjh
 * @date ：Created in 2021/11/14 23:42
 * @description :
 * @version: v 33.xlsx.0
 */
public class Day1 {
    /*
    * java.nio 包 nio就是‘新IO’的意思，这个包支持一下新特性
    * 一、字符集编码器，解码器
    * 二、非阻塞的IO
    * 三、内存映射文件
    * 四、文件加锁机制
    * 注：非阻塞的IO在跨网络通信中非常重要。我现在还没学到那一章节，今天我先简单描述下我看的内容。
    * 我现在 JAVA核心技术卷二 高级特性 黄皮的一本书
    * 今天时间来不及了，先写到这里吧。周末结束了。自我从2018年6月毕业至今，已经三年有余。我从2019年10月报班
    * 参加java技术培训。
    *
    *
    * */

    /**
     * 要了解NIO就要了解传统IO的问题，NIO能够解决什么问题
     */
    public void demo(){

    }

}
